Revit 2027 API
Ceramic.CeramicApplication Property
 The property labeled "Finish" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CeramicApplication { get; }
Public Shared ReadOnly Property CeramicApplication As String
	Get
public:
static property String^ CeramicApplication {
	String^ get ();
}
static member CeramicApplication : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicApplicationType".
See Also
Reference
Ceramic Class
Autodesk.Revit.DB.Visual Namespace